/*=======================================================================
**     KPB03 开发库定义文件
**     文件名    : CAN.h
**     工程名    : T5644ATest
**     系统平台  : BMS32
**     编译平台  : CodeWarrior IDE version 2.8
**     创建日期  : 2012-9-24 18:07:46
**     简介      : CAN模块操作
**     版权      : (c) Copyright KeyPower, 2012
**     开发者    : 张鹏 
**     联系方式  : peng.zhang@key-power.com.cn
**     历史版本  :
**                 	V0.1 2012-9-24  实现基本功能 
**					V0.2 2012-9-25	添加软件缓冲区,修复一些BUG
=======================================================================*/
#ifndef _BMS_PIT_H
#define _BMS_PIT_H

#define ERROR_PIT_OK			0
#define ERROR_PIT_TIMERANGE		1


/*
** ===================================================================
**	名称:InitPIT
**	参数:	
**  功能:  初始化PIT中断服务程序
**  返回值: 
**			...
**	注意:	必须在初始化后才可使用PIT其它函数
** ===================================================================
*/
void InitPIT(void);

/*
** ===================================================================
**	名称:SetPITHook
**	参数:	UINT_8 channel		通道
**									0  PIT通道0 
**									1  PIT通道1 
**									2  PIT通道2
**									3  PIT通道3 
**			void*	func		回调函数			
**										
**  功能:  设置PIT回调函数函数类型是void XXXFUNC(void);
**  返回值: 
**			...
**	注意:	
** ===================================================================
*/

void SetPITHook(UINT_8 channel,void* func);
/*
** ===================================================================
**	名称:SetPIT
**	参数:	UINT_8 channel		通道
**									0  PIT通道0 
**									1  PIT通道1 
**									2  PIT通道2
**									3  PIT通道3 
**			UINT_32	time		PIT周期时间 单位us	
**									0 关闭该通道
**									1000,0000	限制到10s		
**										
**  功能:  设置PIT中断时间
**  返回值: 
**			...
**	注意:	
** ===================================================================
*/
UINT_8 SetPIT(UINT_8 channel,UINT_32 time);

#endif